# 5.	Реализуйте алгоритм перемешивания списка
# (shuffle использовать нельзя, другие методы из библиотеки random - можно).

list = ['1', '2', '3', '4', '5']
order = [3, 1, 2, 4, 0]
list = [list[i] for i in order]
print(list)


